# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# from: https://github.com/ultralytics/ultralytics/pull/16558/files
nc: 4  # số class bạn có

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, CBAM, [256]]        # 👈 Attention layer
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, CBAM, [512]]        # 👈 Attention layer
  - [-1, 1, SPPF, [512, 5]]

head:
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, C3k2, [256]]
  - [-1, 1, CBAM, [256]]        # 👈 Attention layer

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 1, C3k2, [256]]

  - [-1, 1, Detect, [nc]]
